In [1]:
import pandas as pd
import numpy as np
import random

In [23]:
# read the csv file and display the data frame
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93

### Create Index

In [3]:
# create unique values for the index column
new_index = np.arange(0,1000)
new_index[:5]

array([0, 1, 2, 3, 4])

In [4]:
# shuffle the index array
random.shuffle(new_index)
new_index[:5]

array([ 95, 455, 365, 911, 397])

In [12]:
# create a column with new_index
df_exams['new index'] = new_index
df_exams.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new index
0,female,group B,bachelor's degree,standard,none,72,72,74,95
1,female,group C,some college,standard,completed,69,90,88,455
2,female,group B,master's degree,standard,none,90,95,93,365

In [13]:
# set new_index column as index
df_exams.set_index('new index', inplace=True)
df_exams.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new index,,,,,,,,
95,female,group B,bachelor's degree,standard,none,72,72,74
455,female,group C,some college,standard,completed,69,90,88
365,female,group B,master's degree,standard,none,90,95,93

In [19]:
# sort the Data Frame by the index column
df_exams.sort_index(inplace=True)
df_exams.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new index,,,,,,,,
0,male,group D,some high school,standard,completed,62,66,68
1,female,group B,master's degree,free/reduced,completed,77,97,94
2,male,group C,some college,standard,none,61,61,62

### Rename Index

In [21]:
# rename index 0:A, 1:B, 2:C and update the Data Frame
df_exams.rename(index={0:'A', 1:'B', 2:'C'}, inplace=True)
df_exams.head(4)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new index,,,,,,,,
A,male,group D,some high school,standard,completed,62,66,68
B,female,group B,master's degree,free/reduced,completed,77,97,94
C,male,group C,some college,standard,none,61,61,62
3,female,group C,associate's degree,standard,completed,67,84,86